# Файл: main.py
import schedule
import time
import asyncio
from src.engine import run_bot_cycle

def job():
    """Обгортка для запуску асинхронної функції"""
    asyncio.run(run_bot_cycle())

print("🤖 Бот PromoHunter запущено!")
print("⏳ Я буду перевіряти бонуси кожні 2 хвилини (для тесту)...")
print("❌ Щоб зупинити мене, натисни Ctrl + C")

# --- НАЛАШТУВАННЯ РОЗКЛАДУ ---

# Для тесту ставимо кожні 2 хвилини:
schedule.every(20).minutes.do(job)

# А в реальному житті можна ставити так:
# schedule.every().day.at("09:00").do(job)  # Кожен день о 9 ранку
# schedule.every(6).hours.do(job)           # Кожні 6 годин

# --- ВІЧНИЙ ЦИКЛ ---
while True:
    schedule.run_pending()
    time.sleep(1)